public/project/peak-fitness/index.html
<!DOCTYPE html>
<html lang="en-us" dir="ltr">
<head>  <meta charset="utf-8" />
<meta name="viewport" content="width=device-width" />
<link
  rel="icon"
  type="image/png"
  href="http://localhost:1313/porfolio-hugo//icons/favicon-96x96.png"
  sizes="96x96"
/>
<link
  rel="icon"
  type="image/svg+xml"
  href="http://localhost:1313/porfolio-hugo//icons/favicon.svg"
/>
<link rel="shortcut icon" href="http://localhost:1313/porfolio-hugo//icons/favicon.ico" />
<link
  rel="apple-touch-icon"
  sizes="180x180"
  href="http://localhost:1313/porfolio-hugo//icons/apple-touch-icon.png"
/>
<link rel="manifest" href="http://localhost:1313/porfolio-hugo//icons/site.webmanifest" />
<title>
  Peak Fitness | Software Engineering Portfolio
</title>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/normalize.css" />

    <link rel="stylesheet" href="/porfolio-hugo/css/main.css">
 


</head>
<body>
  <header>
    <a href="http://localhost:1313/porfolio-hugo/">
  <h3>Software Engineering Portfolio</h3>
</a>

  </header>
  <main>
    
<section>
  <main style="line-height: 1.5; max-width: 678px">
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Building a Fitness Tracker with React and SQLite WASM
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Overview
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>The Fitness Tracker is a browser-based dashboard designed to help weight-training enthusiasts track their performance, with an emphasis on monitoring Personal Record (PR) weights. The application allows users to log, view, and analyze weightlifting data, providing insights into their progress over time.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Challenges
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<ul>
<li><strong>Data Persistence in the Browser:</strong> Leveraging SQLite WASM to ensure data is stored and retrieved efficiently without a backend.</li>
<li><strong>Responsive User Interface:</strong> Creating a user-friendly dashboard that works seamlessly across devices.</li>
<li><strong>Scalable Data Structures:</strong> Designing the database schema to support current features and future expansions, such as aliases and movement types.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Solutions
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li><strong>SQLite WASM Integration:</strong> Utilized SQLite WASM to enable local, in-browser database management for quick and secure data access.</li>
<li><strong>Dynamic React Components:</strong> Built reusable React components to display and interact with weightlifting data efficiently.</li>
<li><strong>React Router:</strong> Implemented React Router for a smooth and intuitive navigation experience.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Implementation
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<ol>
<li>
<p><strong>Database Design:</strong> Created a `movements` table to track weightlifting data, including:</p>
<ul>
<li>`id`: Unique identifier for each record.</li>
<li>`name`: Name of the movement (e.g., “Deadlift”).</li>
<li>`weight`: Recorded weight lifted.</li>
<li>`date`: Date of the lift, defaulting to the current date.</li>
</ul>
</li>
<li><strong>Data Input:</strong> Developed forms to add new movements and log Personal Record performances.</li>
<li><strong>Data Visualization:</strong> Built a dynamic list to display Personal Records for each movement, with plans for progress charts in future updates.</li>
<li><strong>Planned Features:</strong> Introduced a roadmap for adding aliases, movement types, and detailed progress tracking.</li>
</ol>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Features
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<ul>
<li><strong>Track Personal Records:</strong> View and log PRs for individual movements.</li>
<li><strong>Add New Movements:</strong> Expand the database to include custom exercises.</li>
<li><strong>Future Enhancements:</strong> Support for aliases (e.g., “Military Press” → “Barbell Strict Press”) and movement types (e.g., “dumbbell,” “barbell,” etc.).</li>
</ul>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Technologies Used
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<ul>
<li><strong>React:</strong> For building a responsive and interactive user interface.</li>
<li><strong>SQLite WASM:</strong> To enable browser-based, local data storage.</li>
<li><strong>React Router:</strong> For seamless navigation within the application.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Conclusion
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>The Fitness Tracker combines modern web technologies to provide a simple yet powerful tool for weight-training enthusiasts. By focusing on ease of use and personal record tracking, it empowers users to measure their progress and achieve their fitness goals.</p>
</div>
</div>
</div>
</div>
</main>
</section>

  </main>
  <footer>
    <p>Copyright 2025. All rights reserved.</p>

  </footer>
</body>
</html>
